---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotPlaceBalusterOffset
source: html/8d310e21-3f99-2a68-c31e-b9968066a51b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotPlaceBalusterOffset Property

Can't place Balusters and/or Rails with desired offset

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPlaceBalusterOffset { get; }
```